[
  {"id":"aboue-nzeImpactObstaclesDegree2009","abstract":"What is the impact of obstacles on the graphs of connections between stations in Mobile Ad hoc Networks? In order to answer, at least partially, this question, the first step is to define both an environment with obstacles and a mobility model for the stations in such an environment. The present paper focuses on a new way of considering the mobility within environments with obstacles, while keeping the core ideas of the well-known Random WayPoint mobility model (a.k.a RWP). Based on a mesh-partitioning of the space, we propose a new model called RSP-O-G for which we compute the spatial distribution of stations and analyse how the presence of obstacles impacts this distribution compared to the distribution when no obstacles are present. Coupled with a simple model of radio propagation, and according to the density of stations in the environment, we study the mean degree of the connection graphs corresponding to such mobile ad hoc networks.","accessed":{"date-parts":[["2012",12,12]]},"author":[{"family":"Aboue-Nze","given":"Cédric Gaël"},{"family":"Guinand","given":"Frédéric"},{"family":"Pigné","given":"Yoann"}],"citation-key":"aboue-nzeImpactObstaclesDegree2009","collection-title":"ICNS '09","container-title":"Proceedings of the 2009 Fifth International Conference on Networking and Services","DOI":"10.1109/ICNS.2009.36","event-place":"Valencia, Spain","event-title":"2009 Fifth International Conference on Networking and Services","ISBN":"978-0-7695-3586-9","issued":{"date-parts":[["2009"]]},"page":"332–337","publisher":"IEEE Computer Society","publisher-place":"Valencia, Spain","source":"ACM Digital Library","title":"Impact of Obstacles on the Degree of Mobile Ad Hoc Connection Graphs","type":"paper-conference"},
  {"id":"abouenzeImpactSquareEnvironment2011","abstract":"This paper aims at studying some connectivity properties for random geometric graphs when they are constrained by the topological space in which they are embedded. More precisely, we focus our attention on limited square and rectangular environments. In order to analyse the impact of such environments on related graphs, we observe the evolution of mean degree. We propose an approach aiming at estimating the impact of the environment borders on the connectivity and we provide an analytical formula for computing the mean degree value depending on borders effects.","author":[{"family":"Aboue Nze","given":"G.-C."},{"family":"Guinand","given":"F."},{"family":"Pigné","given":"Y."}],"citation-key":"abouenzeImpactSquareEnvironment2011","container-title":"2011 14th International Symposium on Wireless Personal Multimedia Communications (WPMC)","event-place":"Brest, France","event-title":"2011 14th International Symposium on Wireless Personal Multimedia Communications (WPMC)","issued":{"date-parts":[["2011",10]]},"page":"1-5","publisher-place":"Brest, France","source":"IEEE Xplore","title":"Impact of square environment on the connectivity in finite ad hoc networks","type":"paper-conference"},
  {"id":"balev:hal-04728524","author":[{"family":"Balev","given":"Stefan"},{"family":"Pigné","given":"Yoann"},{"family":"Sanlaville","given":"Éric"},{"family":"Vernet","given":"Mathilde"}],"citation-key":"balev:hal-04728524","container-title":"3rd symposium on algorithmic foundations of dynamic networks (SAND 2024)","DOI":"10.4230/LIPIcs.SAND.2024.24","event-place":"Patras, Greece","issued":{"date-parts":[["2024",5]]},"page":"24:1-24:6","publisher":"Schloss Dagstuhl – Leibniz-Zentrum für Informatik","publisher-place":"Patras, Greece","title":"Brief announcement: The dynamic steiner tree problem: Definitions, complexity, algorithms","type":"paper-conference","URL":"https://normandie-univ.hal.science/hal-04728524","volume":"292"},
  {"id":"balevCopsRobbersDynamic2020","abstract":"We examine the classic game of Cops and Robbers played on models of dynamic graphs, that is, graphs evolving over discrete time steps. At each time step, a graph instance is generated as a subgraph of the underlying graph of the model. The cops and the robber take their turns on the current graph instance. The cops win if they can capture the robber at some point in time. Otherwise, the robber wins.In the offline case, the players are fully aware of the evolution sequence, up to some finite time horizon T. We provide a (𝑛2𝑘+1𝑇)O(n2k+1T)\\mathcal {O}(n^{2k+1}T) algorithm to decide whether a given evolution sequence for an underlying graph with n vertices is k-cop-win via a reduction to a reachability game.In the online case, there is no knowledge of the evolution sequence, and the game might go on forever. Also, each generated instance is required to be connected. We provide a nearly tight characterization for sparse underlying graphs, i.e., with at most linear number of edges. We prove 𝜆+1λ+1\\lambda +1 cops suffice to capture the robber in any underlying graph with 𝑛−1+𝜆n−1+λn-1+\\lambda edges. Further, we define a family of underlying graphs with 𝑛−1+𝜆n−1+λn-1+\\lambda edges where 𝜆−1λ−1\\lambda -1 cops are necessary (and sufficient) for capture.","author":[{"family":"Balev","given":"Stefan"},{"family":"Laredo Jiménez","given":"Juan Luis"},{"family":"Lamprou","given":"Ioannis"},{"family":"Pigné","given":"Yoann"},{"family":"Sanlaville","given":"Eric"}],"citation-key":"balevCopsRobbersDynamic2020","collection-title":"Lecture Notes in Computer Science","container-title":"Structural Information and Communication Complexity","DOI":"10.1007/978-3-030-54921-3_12","editor":[{"family":"Richa","given":"Andrea Werneck"},{"family":"Scheideler","given":"Christian"}],"event-place":"Paderborn, Germany","event-title":"SIROCCO 2020: Structural Information and Communication Complexity","ISBN":"978-3-030-54921-3","issued":{"date-parts":[["2020"]]},"language":"en","page":"203-219","publisher":"Springer International Publishing","publisher-place":"Paderborn, Germany","source":"Springer Link","title":"Cops and Robbers on Dynamic Graphs: Offline and Online Case","title-short":"Cops and Robbers on Dynamic Graphs","type":"paper-conference"},
  {"id":"balevCopsRobbersDynamic2023","abstract":"We examine the classic game of Cops and Robbers played on models of dynamic graphs, that is, graphs evolving over discrete time steps. At each time step, a graph instance is generated as a subgraph of the underlying graph of the model. The cops and the robber take their turns on the current graph instance. The cops win if they can capture the robber at some point in time. Otherwise, the robber wins. In the offline case, the players are fully aware of the evolution sequence, up to some finite time horizon T. We provide a O(n 2k+1 T) algorithm to decide whether a given evolution sequence for an underlying graph with n vertices is k-cop-win via a reduction to a reachability game. In the online case, there is no knowledge of the evolution sequence, and the game might go on forever. Also, each generated instance is required to be connected. We provide a nearly tight characterization for sparse underlying graphs, i.e., with at most linear number of edges. We prove λ + 1 cops suffice to capture the robber in any underlying graph with n − 1 + λ edges. Further, we define a family of underlying graphs with n−1+λ edges where λ−1 cops are necessary (and sufficient) for capture.","accessed":{"date-parts":[["2023",3,16]]},"author":[{"family":"Balev","given":"Stefan"},{"family":"Jiménez Laredo","given":"Juan"},{"family":"Lamprou","given":"Ioannis"},{"family":"Pigné","given":"Yoann"},{"family":"Sanlaville","given":"Eric"}],"citation-key":"balevCopsRobbersDynamic2023","container-title":"Discrete Mathematics & Theoretical Computer Science","DOI":"10.46298/dmtcs.8784","issued":{"date-parts":[["2023",3,16]]},"language":"en","publisher":"Episciences.org","source":"dmtcs.episciences.org","title":"Cops and Robbers on Dynamic Graphs: Offline and Online Case","title-short":"Cops and Robbers on Dynamic Graphs","type":"article-journal","URL":"https://dmtcs.episciences.org/11064/pdf","volume":"vol. 25:1"},
  {"id":"bridonneauAsymptoticDynamicGraph2024","abstract":"In this work, we investigate the analysis of generators for dynamic graphs, which are defined as graphs whose topology changes over time. We focus on generated graphs whose order (number of nodes) varies over time. We use a concept called “sustainability” to qualify the long-term evolution of dynamic graphs. A dynamic graph is considered sustainable if its evolution does not result in a static, empty, or periodic graph. To illustrate how the analysis can be conducted, a parameterized and probability-based generator, named D3G3 (Degree-Driven Dynamic Geometric Graphs Generator), has been introduced in a recent work. From this model, we derive multiple scenarios that correspond to three trends in graph order evolution. Our central contribution lies in a mathematical framework that provides an expectation of the order of the graph at time step $$t+1$$, given its order at time step t. Nevertheless, our analysis underscores the challenge of characterizing the sustainability of dynamic graphs, even when a formal mathematical model for graph order evolution is known.","accessed":{"date-parts":[["2025",1,20]]},"author":[{"family":"Bridonneau","given":"Vincent"},{"family":"Guinand","given":"Frédéric"},{"family":"Pigné","given":"Yoann"}],"citation-key":"bridonneauAsymptoticDynamicGraph2024","container-title":"Applied Network Science","container-title-short":"Appl Netw Sci","DOI":"10.1007/s41109-024-00615-5","ISSN":"2364-8228","issue":"1","issued":{"date-parts":[["2024",6,10]]},"language":"en","page":"21","source":"Springer Link","title":"Asymptotic dynamic graph order evolution analysis","type":"article-journal","URL":"https://doi.org/10.1007/s41109-024-00615-5","volume":"9"},
  {"id":"dorronsoroEvolutionaryAlgorithmsMobile2014","author":[{"family":"Dorronsoro","given":"Bernabé"},{"family":"Ruiz","given":"Patricia"},{"family":"Danoy","given":"Grégoire"},{"family":"Pigné","given":"Yoann"},{"family":"Bouvry","given":"Pascal"}],"citation-key":"dorronsoroEvolutionaryAlgorithmsMobile2014","DOI":"10.1002/9781118833209","event-place":"Hoboken, NJ","ISBN":"978-1-118-83320-9 978-1-118-34113-1","issued":{"date-parts":[["2014",4]]},"language":"english","publisher":"John Wiley & Sons, Inc.","publisher-place":"Hoboken, NJ","title":"Evolutionary Algorithms for Mobile Ad Hoc Networks: Bouvry/Evolutionary Algorithms for Mobile Ad Hoc Networks","title-short":"Evolutionary Algorithms for Mobile Ad Hoc Networks","type":"book"},
  {"id":"ducruet:halshs-04407981","author":[{"family":"Ducruet","given":"César"},{"family":"Polo Martin","given":"Bárbara"},{"family":"Sene","given":"Mame Astou"},{"family":"Lo Prete","given":"Mariantonia"},{"family":"Sun","given":"Ling"},{"family":"Itoh","given":"Hidekazu"},{"family":"Pigné","given":"Yoann"}],"citation-key":"ducruet:halshs-04407981","container-title":"Science of the Total Environment","DOI":"10.1016/j.scitotenv.2024.170099","issued":{"date-parts":[["2024"]]},"page":"170099","publisher":"Elsevier","title":"Ports and their influence on local air pollution and public health: A global analysis","type":"article-journal","URL":"https://shs.hal.science/halshs-04407981","volume":"915"},
  {"id":"guinandReachabilityMaritimeTransportation2016","abstract":"In temporal network a node v is reachable from a node u iff there exists a time-respecting path from u to v. The set of reachable nodes from node u is called the reachability set of u. In this work we describe a simple extension of this metric considering the round-trip reachability. The round-trip reachability set of a node u contains all vertices for which there exists a time-respecting path from u to v temporally followed by a time-respecting path from v to u. Client/Server systems as well as question/answer relations motivate this extension. A container shipping network illustrates the use of such a metric.","author":[{"family":"Guinand","given":"Frédéric"},{"family":"Pigné","given":"Yoann"}],"citation-key":"guinandReachabilityMaritimeTransportation2016","container-title":"Complex Networks: From theory to interdisciplinary applications","event-place":"Marseille","issued":{"date-parts":[["2016",7]]},"publisher-place":"Marseille","title":"Reachability in maritime transportation networks","type":"paper-conference"},
  {"id":"guinandTimeConsiderationsStudy2015","abstract":"This work proposes two new methodological approaches for the analysis of global shipping networks stemmed from containerships movements reported in Lloyds' List Periodicals. After a complex network analysis, the first approach proposes the analysis of sets of networks, called TG-Graphs, built from events occurring in constant-size sliding time windows. Time series represent the evolution of network measures, and the simultaneous analysis of these series for several measures highlights some phenomenons arising in the shipping network. In the second model, networks are modeled with temporal networks where each event is associated with a timestamp. In this model, distance-related measures take a new meaning since paths must obey time constraints. This approach reveals that although the global port network is highly connected, ports who are not directly connected to the main hubs are actually isolated from the rest of the network.","author":[{"family":"Guinand","given":"Frédéric"},{"family":"Pigné","given":"Yoann"}],"citation-key":"guinandTimeConsiderationsStudy2015","collection-title":"Routledge Studies in Transport Analysis","container-title":"Maritime Networks Spatial structures and time dynamics","edition":"César Ducruet","ISBN":"978-1-138-59930-7","issued":{"date-parts":[["2015"]]},"language":"english","page":"163–189","publisher":"Routledge","title":"Time considerations for the study of complex maritime networks","type":"chapter"},
  {"id":"koenigSoldChinaContainer2024a","abstract":"This article analyzes the effects of the acquisition of the Port of Piraeus by the Chinese shipping operator COSCO in July 2016 on the organization of container traffic in Europe. Using real-time container ship positions provided by vessel tracking systems between 2015 and 2019, we study the impact of the privatization of the Greek port on its attractiveness and on that of competing ports for the ships of the various operators, and more particularly of COSCO. Difference-in-difference estimates suggest that the number of container ship calls to the Port of Piraeus has increased following its privatization, but that this increase in attractiveness corresponds mainly to vessels operated by COSCO with a capacity of more than 3000 twenty-foot equivalent units, and in particular to the largest of them. We do not identify any crowding out effect between operators in Piraeus: the use of Piraeus by the vessels of other operators remains relatively unchanged. The privatization of Piraeus seems to have imposed the Greek port as COSCO's transhipment hub for the European market without this being to the detriment of ports in any other particular European area.","accessed":{"date-parts":[["2025",2,9]]},"author":[{"family":"Koenig","given":"Pamina"},{"family":"Poncet","given":"Sandra"},{"family":"Sanch-Maritan","given":"Mathieu"},{"family":"Duvallet","given":"Claude"},{"family":"Pigné","given":"Yoann"}],"citation-key":"koenigSoldChinaContainer2024a","container-title":"Review of International Economics","DOI":"10.1111/roie.12675","ISSN":"1467-9396","issue":"2","issued":{"date-parts":[["2024"]]},"language":"en","license":"© 2023 John Wiley & Sons Ltd.","page":"510-544","source":"Wiley Online Library","title":"Sold to China: Container traffic in the Port of Piraeus","title-short":"Sold to China","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/abs/10.1111/roie.12675","volume":"32"},
  {"id":"lefebvreDiagnosisStructuralTemporal2018","abstract":"This paper concerns the diagnosis of faults for stochastic discrete event systems that behave according to non-Markovian dynamics. k-bounded partially observed Petri nets are used to model the system structure and the sensors. Stochastic processes with probability density functions (pdf) of finite support define the dynamics. Structural and temporal faults are considered. Structural faults correspond to specific sequences of events that should satisfy precedence conditions defined with patterns. Temporal faults are defined with time constraints that must be fulfilled by the firing durations. The probabilities of consistent trajectories are computed with a numerical scheme from the collected timed measurements. The advantage of the proposed scheme is that it can be used for a large variety of pdf that may be defined either with an analytical or a numerical description. It works also for various time semantics. Diagnosis in terms of probability for faulty patterns and temporal constraints is established as a consequence.","author":[{"family":"Lefebvre","given":"Dimitri"},{"family":"Rachidi","given":"Sara"},{"family":"Leclercq","given":"Edouard"},{"family":"Pigné","given":"Yoann"}],"citation-key":"lefebvreDiagnosisStructuralTemporal2018","container-title":"IEEE Transactions on Systems, Man, and Cybernetics: Systems","container-title-short":"IEEE Transactions on Systems, Man, and Cybernetics: Systems","DOI":"10.1109/TSMC.2018.2875726","issued":{"date-parts":[["2018",11,9]]},"page":"1-13","source":"ResearchGate","title":"Diagnosis of Structural and Temporal Faults for k-Bounded Non-Markovian Stochastic Petri Nets","type":"article-journal","volume":"PP"},
  {"id":"lefebvreTemporalFaultDiagnosis2018","author":[{"family":"Lefebvre","given":"Dimitri"},{"family":"Rachidi","given":"Sara"},{"family":"Leclercq","given":"Edouard"},{"family":"Pigné","given":"Yoann"}],"citation-key":"lefebvreTemporalFaultDiagnosis2018","container-title":"5th International Conference on Control, Decision and Information Technologies, CoDIT 2018, Thessaloniki, Greece, April 10-13, 2018","DOI":"10.1109/CoDIT.2018.8394843","event-place":"Thessaloniki, Greece","event-title":"5th International Conference on Control, Decision and Information Technologies (CoDIT)","ISBN":"978-1-5386-5065-3","issued":{"date-parts":[["2018"]]},"page":"271–276","publisher":"IEEE","publisher-place":"Thessaloniki, Greece","source":"DBLP Computer Science Bibliography","title":"Temporal fault diagnosis for k-bounded non-Markovian SPN","type":"paper-conference"},
  {"id":"maBayesianDynamicLinear2019","abstract":"Bayesian dynamic linear model is a promising method for time series data analysis and short-term forecasting. One research issue concerns how the predictive model adapts to changes in the system, especially when shocks impact system behavior. In this study, we propose an adaptive dynamic linear model to adaptively update model parameters for online system state prediction. The proposed method is an automatic approach based on the feedback of prediction errors at each time slot without the needs of external intervention. The experimental study on short-term travel speed prediction shows that the proposed method can significantly reduce the prediction errors of the traditional dynamic linear model and outperform two state-of-the-art methods in the case of major system behavior changes.","accessed":{"date-parts":[["2019",6,24]]},"author":[{"family":"Ma","given":"Tai-Yu"},{"family":"Pigné","given":"Yoann"}],"citation-key":"maBayesianDynamicLinear2019","container-title":"Journal of Advanced Transportation","DOI":"10.1155/2019/5314520","issued":{"date-parts":[["2019"]]},"language":"en","page":"10","title":"Bayesian Dynamic Linear Model with Adaptive Parameter Estimation for Short-Term Travel Speed Prediction","type":"article-journal","URL":"https://www.hindawi.com/journals/jat/2019/5314520/","volume":"2019"},
  {"id":"marvugliaUsingGraphSearch2013","author":[{"family":"Marvuglia","given":"A."},{"family":"Rugani","given":"B."},{"family":"Rios","given":"G."},{"family":"Pigné","given":"Y."},{"family":"Benetto","given":"E."},{"family":"Tiruta-Barna","given":"L."}],"citation-key":"marvugliaUsingGraphSearch2013","container-title":"Metallurgical Research & Technology","DOI":"10.1051/metal/2013050","issue":"1","issued":{"date-parts":[["2013"]]},"page":"8","title":"Using graph search algorithms for a rigorous application of emergy algebra rules","type":"article-journal","volume":"110"},
  {"id":"morel:hal-04990605","author":[{"family":"Morel","given":"Théo"},{"family":"Pigné","given":"Yoann"},{"family":"Duvallet","given":"Claude"}],"citation-key":"morel:hal-04990605","container-title":"French regional conference on complex systems FRCCS 2024","event-place":"Montpellier, France","issued":{"date-parts":[["2024",5]]},"publisher-place":"Montpellier, France","title":"Temporal connectivity of maritime transport networks","type":"paper-conference","URL":"https://hal.science/hal-04990605"},
  {"id":"moulayMetapopulationModelChikungunya2013","abstract":"In this paper we study the influence of populations mobility on the spread of a vector-borne disease. We focus on the chikungunya epidemic event that occurred in 2005–2006 on the Réunion Island, Indian Ocean, France, and validate our models with real epidemic data from the event. We propose a metapopulation model to represent both a high-resolution patch model of the island with realistic population densities and also mobility models for humans (based on real-motion data) and mosquitoes. In this metapopulation network, two models are coupled: one for the dynamics of the mosquito population and one for the transmission of the disease. A high-resolution numerical model is created from real geographical, demographical and mobility data. The Island is modeled with an 18,000-nodes metapopulation network. Numerical results show the impact of the geographical environment and populations’ mobility on the spread of the disease. The model is finally validated against real epidemic data from the Réunion event.","author":[{"family":"Moulay","given":"Djamila"},{"family":"Pigné","given":"Yoann"}],"citation-key":"moulayMetapopulationModelChikungunya2013","container-title":"Journal of Theoretical Biology","container-title-short":"Journal of Theoretical Biology","DOI":"10.1016/j.jtbi.2012.11.008","ISSN":"0022-5193","issued":{"date-parts":[["2013",2,7]]},"page":"129-139","source":"ScienceDirect","title":"A metapopulation model for chikungunya including populations mobility on a large-scale network","type":"article-journal","volume":"318"},
  {"id":"navarretegutierrezComplexityLifeCycle2016","abstract":"Determining the relevance and importance of a technosphere process or a cluster of processes in relation to the rest of the industrial network can provide insights into the sustainability of supply chains: those that need to be optimized or controlled/safeguarded. Network analysis (NA) can offer a broad framework of indicators to tackle this problem. In this article, we present a detailed analysis of a life cycle inventory (LCI) model from an NA perspective. Specifically, the network is represented as a directed graph and the “emergy” numeraire is used as the weight associated with the arcs of the network. The case study of a technological system for drinking water production is presented. We investigate the topological and structural characteristics of the network representation of this system and compare properties of its weighted and unweighted network, as well as the importance of nodes (i.e., life cycle unit processes). By identifying a number of advantages and limitations linked to the modeling complexity of such emergy-LCI networks, we classify the LCI technosphere network of our case study as a complex network belonging to the scale-free network family. The salient feature of this network family is represented by the presence of “hubs”: nodes that connect with many other nodes. Hub failures may imply relevant changes, decreases, or even breaks in the connectedness with other smaller hubs and nodes of the network. Hence, by identifying node centralities, we can rank and interpret the relevance of each node for its special role in the life cycle network.","author":[{"family":"Navarrete Gutiérrez","given":"Tomás"},{"family":"Rugani","given":"Benedetto"},{"family":"Pigné","given":"Yoann"},{"family":"Marvuglia","given":"Antonino"},{"family":"Benetto","given":"Enrico"}],"citation-key":"navarretegutierrezComplexityLifeCycle2016","container-title":"Journal of Industrial Ecology","container-title-short":"Journal of Industrial Ecology","DOI":"10.1111/jiec.12338","ISSN":"1530-9290","issue":"5","issued":{"date-parts":[["2016",10,1]]},"language":"en","page":"1094-1107","source":"Wiley Online Library","title":"On the Complexity of Life Cycle Inventory Networks: Role of Life Cycle Processes with Network Analysis","title-short":"On the Complexity of Life Cycle Inventory Networks","type":"article-journal","URL":"http://onlinelibrary.wiley.com/doi/10.1111/jiec.12338/abstract","volume":"20"},
  {"id":"pigneMobiliteDansGraphes2022","abstract":"Ce travail a pour objet de présenter et de synthétiser l'activité scientifique et les travaux de recherche menés durant ma carrière académique. Il couvre une période allant de la fin de ma thèse en 2008 à fin 2022. La notion de graphe, et en particulier celle de graphe dynamique, est transversale à mon champ de recherche. Ce modèle de représentation est omniprésent dans tout ce qui est présenté ici, allant des réseaux de véhicules aux calculs de composantes connexes, en passant par le trafic maritime. Le document est organisé autour de trois axes principaux, à savoir la mobilité, l’analyse et l’algorithmique dans le domaine des graphes dynamiques. Chacun de ces axes regroupe les travaux correspondants et couvre également une fenêtre temporelle spécifique, avec des recouvrements possibles. L'axe mobilité couvre principalement les travaux menés au début de la période (environ 2009 à 2015). Le premier chapitre, intitulé \"Mobilité des véhicules\", revient sur les travaux menés lors de mon post-doctorat au Luxembourg, portant sur la simulation de réseau et la modélisation de trafic routier. Le deuxième chapitre présente un travail sur la représentation des obstacles dans les réseaux mobiles ad hoc. Le troisième chapitre discute des résultats obtenus en épidémiologie. L'axe analyse concerne les travaux réalisés au milieu de la période (environ 2014 à 2018). Le premier chapitre examine la collaboration avec des chercheurs en sciences de l'environnement et concerne l'analyse du cycle de vie. Le deuxième chapitre examine les réseaux de transport maritimes. L'axe algorithmique concerne les travaux les plus récents (environ 2018 à 2022). Dans cet axe, les deux chapitres, le premier portant sur les flux, le second sur la connectivité, s'intéressent à ces notions classiques, appliquées au cas dynamique.","accessed":{"date-parts":[["2023",3,21]]},"author":[{"family":"Pigné","given":"Yoann"}],"citation-key":"pigneMobiliteDansGraphes2022","genre":"Habilitation à diriger des recherches","issued":{"date-parts":[["2022",12,13]]},"language":"fr","publisher":"Université le Havre Normandie","source":"hal.science","title":"Mobilité dans les graphes dynamiques","type":"thesis","URL":"https://hal.science/tel-03941183"},
  {"id":"pigneModelisationTraitementDecentralise2008","abstract":"Les graphes dynamiques sont un outil de plus en plus utilisé dans des contextes variés où il s'avère nécessaire de modéliser des environnements changeants ou incertains. Les modèles aujourd'hui proposés sont dédiés à ces applications précises. Il n'existe pas de modèle général reprenant, hors de tout contexte applicatif, ces caractéristiques. D'autre part la résolution de problèmes liés à ces environnements dynamiques et incertains est problématique. Nous proposons, ici, la formalisation d'un modèle général de graphe dynamique.   Nous étudions la résolution de problèmes dans ces graphes à l'aide de méthodes inspirées de mécanismes d'intelligence collective.   Les modèles proposés sont validés dans le contexte applicatif des réseaux mobiles ad hoc. Une approche originale de construction et de maintien de chemins de communication sous plusieurs contraintes est proposée. Le problème de la construction et du maintien d'une forêt couvrante dans un réseau mobile ad hoc est également étudié.","accessed":{"date-parts":[["2013",1,10]]},"author":[{"family":"Pigné","given":"Yoann"}],"citation-key":"pigneModelisationTraitementDecentralise2008","issued":{"date-parts":[["2008",12,4]]},"publisher":"Université du Havre","source":"tel.archives-ouvertes.fr","title":"Modélisation et traitement décentralisé des graphes dynamiques Application aux réseaux mobiles ad hoc","type":"thesis","URL":"http://tel.archives-ouvertes.fr/tel-00371962"},
  {"id":"pignePlatformRealisticOnline2010","abstract":"This paper introduces a platform for realistic and computationally efficient online vehicular networks simulation. It permits decentralized traffic management applications simulation as nodes mobility is modifiable at runtime thanks to the integration of two state-of-the-art network and traffic simulators. The platform embeds a tool that generates vehicular traces based on traffic counting data and ensures performance through a geographical decomposition of the network. Evidence of its performance is given on a Luxembougian traffic management scenario, using real road network and traffic data.","author":[{"family":"Pigné","given":"Yoann"},{"family":"Danoy","given":"Grégoire"},{"family":"Bouvry","given":"Pascal"}],"citation-key":"pignePlatformRealisticOnline2010","container-title":"IEEE International Workshop on Management of Emerging Networks and Services","DOI":"10.1109/GLOCOMW.2010.5700389","event-place":"Miami, FL, USA","event-title":"IEEE Globecom Workshops","ISBN":"978-1-4244-8863-6","issued":{"date-parts":[["2010"]]},"page":"615–619","publisher":"IEEE Computer Society","publisher-place":"Miami, FL, USA","title":"A Platform for Realistic Online Vehicular Network Management","type":"paper-conference"},
  {"id":"pigneSensitivityAnalysisRealistic2011","abstract":"In this article, we consider a realistic vehicular mobility model, VehILux, and use a sensitivity analysis method to quantitatively study the influence and interdependencies of its parameters. The analysis reveals several properties in the set of parameters. Some are identified as irrelevant to the output while some have stronger impact than expected. This analysis is proposed as a preliminary step to the mobility model optimization, as it permits to significantly reduce the parameters search space.","accessed":{"date-parts":[["2012",12,12]]},"author":[{"family":"Pigné","given":"Yoann"},{"family":"Danoy","given":"Grégoire"},{"family":"Bouvry","given":"Pascal"}],"citation-key":"pigneSensitivityAnalysisRealistic2011","collection-title":"DIVANet '11","container-title":"Proceedings of the first ACM international symposium on Design and analysis of intelligent vehicular networks and applications","DOI":"10.1145/2069000.2069007","event-place":"Miami, FL, USA","event-title":"DIVANet '11","ISBN":"978-1-4503-0904-2","issued":{"date-parts":[["2011"]]},"page":"31–38","publisher":"ACM","publisher-place":"Miami, FL, USA","source":"ACM Digital Library","title":"Sensitivity analysis for a realistic vehicular mobility model","type":"paper-conference"},
  {"id":"pigneShortRobustCommunication2010","abstract":"We consider the problem of finding and maintaining communication paths in wireless mobile ad hoc networks (MANET). We consider this problem as a bi-objective problem when trying to minimize both the length of the constructed paths and the number link reconnections. We propose two centralized algorithms that help analyse the problem from a dynamic graph point of view. These algorithms give lower bounds for our proposed decentralized ant-based algorithm that constructs and maintains such paths in a MANET.","accessed":{"date-parts":[["2013",11,27]]},"author":[{"family":"Pigné","given":"Yoann"},{"family":"Guinand","given":"Frédéric"}],"citation-key":"pigneShortRobustCommunication2010","collection-title":"Lecture Notes in Computer Science","container-title":"Swarm Intelligence","DOI":"10.1007/978-3-642-15461-4_52","editor":[{"family":"Dorigo","given":"Marco"},{"family":"Birattari","given":"Mauro"},{"family":"Caro","given":"Gianni A. Di"},{"family":"Doursat","given":"René"},{"family":"Engelbrecht","given":"Andries P."},{"family":"Floreano","given":"Dario"},{"family":"Gambardella","given":"Luca Maria"},{"family":"Groß","given":"Roderich"},{"family":"Şahin","given":"Erol"},{"family":"Sayama","given":"Hiroki"},{"family":"Stützle","given":"Thomas"}],"event-place":"Brussels, Belgium","event-title":"7th International Conference, ANTS 2010","issued":{"date-parts":[["2010",1,1]]},"license":"©2010 Springer-Verlag Berlin Heidelberg","page":"520-527","publisher":"Springer Berlin Heidelberg","publisher-place":"Brussels, Belgium","source":"link.springer.com","title":"Short and Robust Communication Paths in Dynamic Wireless Networks","type":"paper-conference"},
  {"id":"pigneToolOperationalizeDynamic2020","abstract":"The objective is to demonstrate an operational tool for dynamic LCA, based on the model by Tiruta-Barna et al. (J Clean Prod 116:198-206, Tiruta-Barna et al. 2016). The main innovation lies in the combination of full temporalization of the background inventory and a graph search algorithm leading to full dynamic LCI, further coupled to dynamic LCIA. The following objectives were addressed: (1) development of a database with temporal parameters for all processes of ecoinvent 3.2, (2) implementation of the model and the database in integrated software, and (3) demonstration on a case study comparing a conventional internal combustion engine car to an electric one.","accessed":{"date-parts":[["2020",9,25]]},"author":[{"family":"Pigné","given":"Yoann"},{"family":"Navarrete Gutiérrez","given":"Tomás Navarrete"},{"family":"Gibon","given":"Thomas"},{"family":"Schaubroeck","given":"Thomas"},{"family":"Popovici","given":"Emil"},{"family":"Shimako","given":"Allan Hayato"},{"family":"Benetto","given":"Enrico"},{"family":"Tiruta-Barna","given":"Ligia"}],"citation-key":"pigneToolOperationalizeDynamic2020","container-title":"The International Journal of Life Cycle Assessment","container-title-short":"Int J Life Cycle Assess","DOI":"10.1007/s11367-019-01696-6","ISSN":"1614-7502","issue":"2","issued":{"date-parts":[["2020",2,1]]},"language":"en","page":"267-279","source":"Springer Link","title":"A tool to operationalize dynamic LCA, including time differentiation on the complete background database","type":"article-journal","URL":"https://doi.org/10.1007/s11367-019-01696-6","volume":"25"},
  {"id":"pigneVehicularMobilityModel2011","abstract":"This paper proposes VehILux, a new vehicular mobility model based on real traffic counting data. It relies on two freely available sources of real information for the country of Luxembourg. The first source is traffic data collected by counting devices located on the Luxembourgian road network, while the second is geographical information about different types of areas: residential, industrial, commercial and other services. VehILux models vehicles commuting around the city of Luxembourg by considering two types of traffic, outer traffic with vehicles entering in the defined geographical area and inner traffic starting from residential zones located inside the geographical area. One part of the collected traffic data is used as input traffic, while another part is used to control the produced traffic and to fine-tune the model. VehILux is coupled with the microscopic road traffic simulator SUMO to produce realistic vehicular traces.","accessed":{"date-parts":[["2015",3,2]]},"author":[{"family":"Pigné","given":"Yoann"},{"family":"Danoy","given":"Grégoire"},{"family":"Bouvry","given":"Pascal"}],"citation-key":"pigneVehicularMobilityModel2011","collection-title":"Nets4Cars/Nets4Trains'11","container-title":"Proceedings of the Third International Conference on Communication Technologies for Vehicles","DOI":"10.1007/978-3-642-19786-4_12","event-place":"Berlin, Heidelberg","event-title":"Nets4Cars/Nets4Trains 2011","ISBN":"978-3-642-19785-7","issued":{"date-parts":[["2011"]]},"page":"131–142","publisher":"Springer-Verlag","publisher-place":"Berlin, Heidelberg","source":"ACM Digital Library","title":"A Vehicular Mobility Model Based on Real Traffic Counting Data","type":"paper-conference"},
  {"id":"rachidiMovingAverageControl2018","author":[{"family":"Rachidi","given":"Sara"},{"family":"Leclercq","given":"Edouard"},{"family":"Pigné","given":"Yoann"},{"family":"Lefebvre","given":"Dimitri"}],"citation-key":"rachidiMovingAverageControl2018","container-title":"23rd IEEE International Conference on Emerging Technologies and Factory Automation, ETFA 2018, Torino, Italy, September 4-7, 2018","DOI":"10.1109/ETFA.2018.8502633","event-place":"Torino, Italy","event-title":"2018 IEEE 23rd International Conference on Emerging Technologies and Factory Automation (ETFA)","issued":{"date-parts":[["2018"]]},"page":"493–498","publisher":"IEEE","publisher-place":"Torino, Italy","source":"DBLP Computer Science Bibliography","title":"Moving Average control chart for the detection and isolation of temporal faults in stochastic Petri nets","type":"paper-conference"},
  {"id":"saadaNewSelectionStrategies2017","abstract":"Wireless Sensor and Actor Networks are used in many dangerous applications. When performing their tasks, actors may fail due to harsh environments in which they are deployed. Some actors are cut-vertices within network. Their loss breaks its connectivity and disrupts its operation accordingly. Therefore, restoring network connectivity is crucial. DARA is among the most popular connectivity restoration schemes. It performs multi-actor relocations in order to replace a failed cut-vertex by one of its neighbors, based on the lowest degree. In this paper, we propose new selection strategies of actor’s substitute in DARA, in which the substitute selection is based on the nature of the links with neighbors rather than on the degree. Our approaches improve the performance of DARA by reducing the number of relocated actors in the recovery process by 24% on average compared to its original selection strategy. The proposed strategies are validated through simulation experiments.","author":[{"family":"Saada","given":"Riadh"},{"family":"Pigné","given":"Yoann"},{"family":"Olivier","given":"Damien"}],"citation-key":"saadaNewSelectionStrategies2017","collection-title":"Lecture Notes of the Institute for Computer Sciences, Social Informatics and Telecommunications Engineering","container-title":"Ad Hoc Networks","DOI":"10.1007/978-3-319-51204-4_4","editor":[{"family":"Zhou","given":"Yifeng"},{"family":"Kunz","given":"Thomas"}],"event-place":"Ottawa, Canada","event-title":"8th International Conference, ADHOCNETS 2016","ISBN":"978-3-319-51204-4","issued":{"date-parts":[["2017"]]},"language":"en","page":"38-49","publisher":"Springer International Publishing","publisher-place":"Ottawa, Canada","source":"Springer Link","title":"New Selection Strategies of Actor’s Substitute in DARA for Connectivity Restoration in WSANs","type":"paper-conference"},
  {"id":"seredynskiGenerationRealisticMobility2012","author":[{"family":"Seredynski","given":"M."},{"family":"Danoy","given":"G."},{"family":"Tabatabaei","given":"M."},{"family":"Bouvry","given":"P."},{"family":"Pigné","given":"Y."}],"citation-key":"seredynskiGenerationRealisticMobility2012","container-title":"2012 IEEE Congress on Evolutionary Computation (CEC)","DOI":"10.1109/CEC.2012.6252987","event-place":"Brisbane, QLD, Australia","issued":{"date-parts":[["2012",6]]},"page":"1–8","publisher-place":"Brisbane, QLD, Australia","title":"Generation of realistic mobility for VANETs using genetic algorithms","type":"paper-conference"},
  {"id":"shimakoEnvironmentalAssessmentBioenergy2016","abstract":"Microalgae have been studied as a potential alternative raw material and various technologies have been proposed to transform the algal biomass into energy products. In this study, two bioenergy production systems of very different complexities were modelled to assess their environmental efficiencies: a biodiesel system and a biogas system. Biodiesel system used supercritical extraction and transesterification as key processes; to the best of authors' knowledge, there is no previous work analysing the environmental performances of such production system. Cumulative energy demand, Life Cycle Assessment (LCA) and dynamic LCA for climate change were used to evaluate the environmental footprint of the production systems. Conventional systems for electricity, heat and diesel production were considered for comparison. Energy balance showed that the supercritical extraction and drying steps were the most energy consuming unit operations in biodiesel production and further developments of technologies might be envisaged. LCA showed that climate change was the main contributor to impacts on human health and ecosystem quality due to energy consumed in production steps. Also, heat from biogas was the only product that proved to have a satisfactory environmental performance with regard to other conventional production systems. Finally, dynamic climate change evaluation (used for the first time for bio-chemical processes) revealed no carbon sequestration in microalgae system.","author":[{"family":"Shimako","given":"Allan Hayato"},{"family":"Tiruta-Barna","given":"Ligia"},{"family":"Pigné","given":"Yoann"},{"family":"Benetto","given":"Enrico"},{"family":"Navarrete Gutiérrez","given":"Tomás"},{"family":"Guiraud","given":"Pascal"},{"family":"Ahmadi","given":"Aras"}],"citation-key":"shimakoEnvironmentalAssessmentBioenergy2016","container-title":"Journal of Cleaner Production","DOI":"10.1016/j.jclepro.2016.08.003","ISSN":"0959-6526","issued":{"date-parts":[["2016",12]]},"page":"51–60","title":"Environmental assessment of bioenergy production from microalgae based systems","type":"article-journal","volume":"139"},
  {"id":"tiruta-barnaFrameworkComputationalTool2016","abstract":"Conventional Life Cycle Inventories (LCIs) are static models of product systems without time dependent functioning of plants and time lags between supply and demand of products. The aggregation of environmental interventions without consideration of the time dimension represents an acknowledged limitation of the Life Cycle Assessment (LCA) method. In this paper we present a novel conceptual and computational framework for the consideration of time dependency in LCIs. Process modeling is used to describe the production flows and environmental interventions of each unit process and supply modeling is used to include time lags on the raw materials exchanged by unit processes of the product system. The combination of production and supply models in life cycle networks, based on a set of specific temporal parameters (representative functioning period, production time, supply delay, supply frequency), allows the characterization of time dependency in each node. For the computation of time dependent LCI, i.e. of the time resolved environmental interventions, graph search algorithm is proposed and implemented in a prototype Web application. In terms of results, the new approach provides time dependent LCI expressed as: i) time as a function of individual emission (or resource consumption) for individual processes, ii) aggregated time as a function of a given environmental intervention. A test bed case illustrating the effectiveness of the conceptual and computational approaches (proof of concept) is presented and successfully solved both analytically and numerically.","author":[{"family":"Tiruta-Barna","given":"Ligia"},{"family":"Pigné","given":"Yoann"},{"family":"Navarrete Gutiérrez","given":"Tomás"},{"family":"Benetto","given":"Enrico"}],"citation-key":"tiruta-barnaFrameworkComputationalTool2016","container-title":"Journal of Cleaner Production","container-title-short":"Journal of Cleaner Production","DOI":"10.1016/j.jclepro.2015.12.049","ISSN":"0959-6526","issued":{"date-parts":[["2016",3,10]]},"page":"198-206","source":"ScienceDirect","title":"Framework and computational tool for the consideration of time dependency in Life Cycle Inventory: proof of concept","title-short":"Framework and computational tool for the consideration of time dependency in Life Cycle Inventory","type":"article-journal","URL":"http://www.sciencedirect.com/science/article/pii/S0959652615018739","volume":"116"},
  {"id":"vernetAlgorithmiqueDansGraphes2018","author":[{"family":"Vernet","given":"Mathilde"},{"family":"Pigné","given":"Yoann"},{"family":"Sanlaville","given":"Eric"}],"citation-key":"vernetAlgorithmiqueDansGraphes2018","event-place":"Lorient, France","event-title":"ROADEF 2018","issued":{"date-parts":[["2018",2]]},"publisher-place":"Lorient, France","title":"Algorithmique dans les graphes dynamiques : le cas des flots","type":"paper-conference","URL":"https://hal.archives-ouvertes.fr/hal-02115413"},
  {"id":"vernetStudyConnectivityDynamic2022","abstract":"This work focuses on connectivity in a dynamic graph. An undirected graph is defined on a finite and discrete time interval. Edges can appear and disappear over time. The first objective of this work is to extend the notion of connected component to dynamic graphs in a new way. Persistent connected components are defined by their size, corresponding to the number of vertices, and their length, corresponding to the number of consecutive time steps they are present on. The second objective of this work is to develop an algorithm computing the largest, in terms of size and length, persistent connected components in a dynamic graph. PICCNIC algorithm (PersIstent Connected CompoNent InCremental Algorithm) is a polynomial time algorithm of minimal complexity. Another advantage of this algorithm is that it works online: knowing the evolution of the dynamic graph is not necessary to execute it. PICCNIC algorithm is implemented using the GraphStream library and experimented in order to carefully study the outcome of the algorithm according to different input graph types, as well as real data networks, to verify the theoretical complexity, and to confirm its feasibility for graphs of large size.","accessed":{"date-parts":[["2022",7,5]]},"author":[{"family":"Vernet","given":"Mathilde"},{"family":"Pigné","given":"Yoann"},{"family":"Sanlaville","given":"Éric"}],"citation-key":"vernetStudyConnectivityDynamic2022","container-title":"4OR","container-title-short":"4OR-Q J Oper Res","DOI":"10.1007/s10288-022-00507-3","ISSN":"1614-2411","issued":{"date-parts":[["2022",4,19]]},"language":"en","source":"Springer Link","title":"A study of connectivity on dynamic graphs: computing persistent connected components","title-short":"A study of connectivity on dynamic graphs","type":"article-journal","URL":"https://doi.org/10.1007/s10288-022-00507-3"},
  {"id":"vernetSuccessiveShortestPath2018","abstract":"This work focuses on the minimum cost flow problem in dynamic graphs. We use a model in which there are no travel time on arcs, and storage on vertices is not al- lowed. Every other graph parameter is time-dependent. We propose a method using the successive shortest path algorithm that avoids using the time-expanded graph that significantly increases the complexity of the problem. Our method is implemented using the GraphStream library.","author":[{"family":"Vernet","given":"Mathilde"},{"family":"Drozdowski","given":"Maciej"},{"family":"Pigné","given":"Yoann"},{"family":"Sanlaville","given":"Eric"}],"citation-key":"vernetSuccessiveShortestPath2018","container-title":"16th Cologne-Twente Workshop on Graphs and Combinatorial Optimization","event-place":"Paris, France","event-title":"Cologne-Twente Workshop on Graphs and Combinatorial Optimization","issued":{"date-parts":[["2018",6,18]]},"page":"51--54","publisher-place":"Paris, France","title":"Successive Shortest Path Algorithm for Flows in Dynamic Graphs","type":"paper-conference","URL":"http://ctw18.lipn.univ-paris13.fr/CTW18_Proceedings.pdf"},
  {"id":"vernetTheoreticalExperimentalStudy2020","abstract":"This work focuses on the minimum cost flow problem in dynamic graphs. The model here proposed does not have travel time nor storage but all other parameters are time-dependent. The most popular method to solve this kind of problem uses the time-expanded graph but due to the large size of this graph, this solution technique is not manageable on a long time horizon. We propose a new approach that does not use the time-expanded graph. Our algorithm is based on the computation of successive shortest paths on static graphs, which are much smaller compared to the time-expanded graph. It has a significantly better computational complexity. Our method was implemented using the GraphStream library and experiments showed that it is also much faster than the classical method in practice.","accessed":{"date-parts":[["2020",9,25]]},"author":[{"family":"Vernet","given":"Mathilde"},{"family":"Drozdowski","given":"Maciej"},{"family":"Pigné","given":"Yoann"},{"family":"Sanlaville","given":"Eric"}],"citation-key":"vernetTheoreticalExperimentalStudy2020","container-title":"Discrete Applied Mathematics","container-title-short":"Discrete Applied Mathematics","DOI":"10.1016/j.dam.2019.12.012","ISSN":"0166-218X","issued":{"date-parts":[["2020",1,7]]},"language":"en","source":"ScienceDirect","title":"A theoretical and experimental study of a new algorithm for minimum cost flow in dynamic graphs","type":"article-journal","URL":"http://www.sciencedirect.com/science/article/pii/S0166218X19305554"},
  {"id":"wawrzyniakQuayPartitioningProblem2024","abstract":"In this paper, we introduce the quay partitioning problem (QPP), that is, a problem of partitioning quay length into berths for minimum ship waiting time. Such a problem arises when designing the terminal layout. Two schemes of quay layout are considered: with at most one ship in a berth and with at most two ships in a berth. Ship arrival times, service times, lengths, and weights are given. We show that QPP is NP-hard. The two versions of QPP are formulated as mixed integer linear programs (MIPs). Scalability of solving QPPs as MIPs is studied. We investigate, analytically and in computational experiments, features of the QPP solutions such as (i) changes in solution quality when one long berth length is used versus choosing various berth lengths flexibly, (ii) what lengths of berths are chosen when ship lengths mixture is changing, (iii) what is the impact of congestion on the chosen berth lengths, and (iv) how much is one quay layout scheme better than the other.","accessed":{"date-parts":[["2024",1,24]]},"author":[{"family":"Wawrzyniak","given":"Jakub"},{"family":"Drozdowski","given":"Maciej"},{"family":"Sanlaville","given":"Éric"},{"family":"Pigné","given":"Yoann"},{"family":"Guinand","given":"Frederic"}],"citation-key":"wawrzyniakQuayPartitioningProblem2024","container-title":"International Transactions in Operational Research","DOI":"10.1111/itor.13389","ISSN":"1475-3995","issue":"3","issued":{"date-parts":[["2024"]]},"language":"en","license":"© 2023 International Federation of Operational Research Societies.","page":"1554-1584","source":"Wiley Online Library","title":"Quay partitioning problem","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/abs/10.1111/itor.13389","volume":"31"}
]
