[
  {
    "id": "http://zotero.org/users/809971/items/USJVF8AK",
    "type": "paper-conference",
    "abstract": "We examine the classic game of Cops and Robbers played on models of dynamic graphs, that is, graphs evolving over discrete time steps. At each time step, a graph instance is generated as a subgraph of the underlying graph of the model. The cops and the robber take their turns on the current graph instance. The cops win if they can capture the robber at some point in time. Otherwise, the robber wins.In the offline case, the players are fully aware of the evolution sequence, up to some finite time horizon T. We provide a (𝑛2𝑘+1𝑇)O(n2k+1T)\\mathcal {O}(n^{2k+1}T) algorithm to decide whether a given evolution sequence for an underlying graph with n vertices is k-cop-win via a reduction to a reachability game.In the online case, there is no knowledge of the evolution sequence, and the game might go on forever. Also, each generated instance is required to be connected. We provide a nearly tight characterization for sparse underlying graphs, i.e., with at most linear number of edges. We prove 𝜆+1λ+1\\lambda +1 cops suffice to capture the robber in any underlying graph with 𝑛−1+𝜆n−1+λn-1+\\lambda edges. Further, we define a family of underlying graphs with 𝑛−1+𝜆n−1+λn-1+\\lambda edges where 𝜆−1λ−1\\lambda -1 cops are necessary (and sufficient) for capture.",
    "collection-title": "Lecture Notes in Computer Science",
    "container-title": "Structural Information and Communication Complexity",
    "DOI": "10.1007/978-3-030-54921-3_12",
    "event-place": "Cham",
    "ISBN": "978-3-030-54921-3",
    "language": "en",
    "page": "203-219",
    "publisher": "Springer International Publishing",
    "publisher-place": "Cham",
    "source": "Springer Link",
    "title": "Cops and Robbers on Dynamic Graphs: Offline and Online Case",
    "title-short": "Cops and Robbers on Dynamic Graphs",
    "author": [
      {
        "family": "Balev",
        "given": "Stefan"
      },
      {
        "family": "Laredo Jiménez",
        "given": "Juan Luis"
      },
      {
        "family": "Lamprou",
        "given": "Ioannis"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      },
      {
        "family": "Sanlaville",
        "given": "Eric"
      }
    ],
    "editor": [
      {
        "family": "Richa",
        "given": "Andrea Werneck"
      },
      {
        "family": "Scheideler",
        "given": "Christian"
      }
    ],
    "issued": {
      "date-parts": [["2020"]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/69GD86IU",
    "type": "article-journal",
    "title": "Environmental assessment of bioenergy production from microalgae based systems",
    "container-title": "Journal of Cleaner Production",
    "page": "51-60",
    "volume": "139",
    "source": "ScienceDirect",
    "abstract": "Microalgae have been studied as a potential alternative raw material and various technologies have been proposed to transform the algal biomass into energy products. In this study, two bioenergy production systems of very different complexities were modelled to assess their environmental efficiencies: a biodiesel system and a biogas system. Biodiesel system used supercritical extraction and transesterification as key processes; to the best of authors' knowledge, there is no previous work analysing the environmental performances of such production system. Cumulative energy demand, Life Cycle Assessment (LCA) and dynamic LCA for climate change were used to evaluate the environmental footprint of the production systems. Conventional systems for electricity, heat and diesel production were considered for comparison. Energy balance showed that the supercritical extraction and drying steps were the most energy consuming unit operations in biodiesel production and further developments of technologies might be envisaged. LCA showed that climate change was the main contributor to impacts on human health and ecosystem quality due to energy consumed in production steps. Also, heat from biogas was the only product that proved to have a satisfactory environmental performance with regard to other conventional production systems. Finally, dynamic climate change evaluation (used for the first time for bio-chemical processes) revealed no carbon sequestration in microalgae system.",
    "URL": "http://www.sciencedirect.com/science/article/pii/S0959652616311283",
    "DOI": "10.1016/j.jclepro.2016.08.003",
    "ISSN": "0959-6526",
    "journalAbbreviation": "Journal of Cleaner Production",
    "author": [
      {
        "family": "Shimako",
        "given": "Allan Hayato"
      },
      {
        "family": "Tiruta-Barna",
        "given": "Ligia"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      },
      {
        "family": "Benetto",
        "given": "Enrico"
      },
      {
        "family": "Navarrete Gutiérrez",
        "given": "Tomás"
      },
      {
        "family": "Guiraud",
        "given": "Pascal"
      },
      {
        "family": "Ahmadi",
        "given": "Aras"
      }
    ],
    "issued": {
      "date-parts": [["2016", 12, 15]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/D66HZ8KX",
    "type": "article-journal",
    "title": "On the Complexity of Life Cycle Inventory Networks: Role of Life Cycle Processes with Network Analysis",
    "container-title": "Journal of Industrial Ecology",
    "page": "1094-1107",
    "volume": "20",
    "issue": "5",
    "source": "Wiley Online Library",
    "abstract": "Determining the relevance and importance of a technosphere process or a cluster of processes in relation to the rest of the industrial network can provide insights into the sustainability of supply chains: those that need to be optimized or controlled/safeguarded. Network analysis (NA) can offer a broad framework of indicators to tackle this problem. In this article, we present a detailed analysis of a life cycle inventory (LCI) model from an NA perspective. Specifically, the network is represented as a directed graph and the “emergy” numeraire is used as the weight associated with the arcs of the network. The case study of a technological system for drinking water production is presented. We investigate the topological and structural characteristics of the network representation of this system and compare properties of its weighted and unweighted network, as well as the importance of nodes (i.e., life cycle unit processes). By identifying a number of advantages and limitations linked to the modeling complexity of such emergy-LCI networks, we classify the LCI technosphere network of our case study as a complex network belonging to the scale-free network family. The salient feature of this network family is represented by the presence of “hubs”: nodes that connect with many other nodes. Hub failures may imply relevant changes, decreases, or even breaks in the connectedness with other smaller hubs and nodes of the network. Hence, by identifying node centralities, we can rank and interpret the relevance of each node for its special role in the life cycle network.",
    "URL": "http://onlinelibrary.wiley.com/doi/10.1111/jiec.12338/abstract",
    "DOI": "10.1111/jiec.12338",
    "ISSN": "1530-9290",
    "shortTitle": "On the Complexity of Life Cycle Inventory Networks",
    "journalAbbreviation": "Journal of Industrial Ecology",
    "language": "en",
    "author": [
      {
        "family": "Navarrete-Gutiérrez",
        "given": "Tomás"
      },
      {
        "family": "Rugani",
        "given": "Benedetto"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      },
      {
        "family": "Marvuglia",
        "given": "Antonino"
      },
      {
        "family": "Benetto",
        "given": "Enrico"
      }
    ],
    "issued": {
      "date-parts": [["2016", 10, 1]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/FRVP64MF",
    "type": "article-journal",
    "title": "Framework and computational tool for the consideration of time dependency in Life Cycle Inventory: proof of concept",
    "container-title": "Journal of Cleaner Production",
    "page": "198-206",
    "volume": "116",
    "source": "ScienceDirect",
    "abstract": "Conventional Life Cycle Inventories (LCIs) are static models of product systems without time dependent functioning of plants and time lags between supply and demand of products. The aggregation of environmental interventions without consideration of the time dimension represents an acknowledged limitation of the Life Cycle Assessment (LCA) method. In this paper we present a novel conceptual and computational framework for the consideration of time dependency in LCIs. Process modeling is used to describe the production flows and environmental interventions of each unit process and supply modeling is used to include time lags on the raw materials exchanged by unit processes of the product system. The combination of production and supply models in life cycle networks, based on a set of specific temporal parameters (representative functioning period, production time, supply delay, supply frequency), allows the characterization of time dependency in each node. For the computation of time dependent LCI, i.e. of the time resolved environmental interventions, graph search algorithm is proposed and implemented in a prototype Web application. In terms of results, the new approach provides time dependent LCI expressed as: i) time as a function of individual emission (or resource consumption) for individual processes, ii) aggregated time as a function of a given environmental intervention. A test bed case illustrating the effectiveness of the conceptual and computational approaches (proof of concept) is presented and successfully solved both analytically and numerically.",
    "URL": "http://www.sciencedirect.com/science/article/pii/S0959652615018739",
    "DOI": "10.1016/j.jclepro.2015.12.049",
    "ISSN": "0959-6526",
    "shortTitle": "Framework and computational tool for the consideration of time dependency in Life Cycle Inventory",
    "journalAbbreviation": "Journal of Cleaner Production",
    "author": [
      {
        "family": "Tiruta-Barna",
        "given": "Ligia"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      },
      {
        "family": "Navarrete Gutiérrez",
        "given": "Tomás"
      },
      {
        "family": "Benetto",
        "given": "Enrico"
      }
    ],
    "issued": {
      "date-parts": [["2016", 3, 10]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/UMIGGF8E",
    "type": "article-journal",
    "title": "A metapopulation model for chikungunya including populations mobility on a large-scale network",
    "container-title": "Journal of Theoretical Biology",
    "page": "129-139",
    "volume": "318",
    "source": "ScienceDirect",
    "abstract": "In this paper we study the influence of populations mobility on the spread of a vector-borne disease. We focus on the chikungunya epidemic event that occurred in 2005–2006 on the Réunion Island, Indian Ocean, France, and validate our models with real epidemic data from the event. We propose a metapopulation model to represent both a high-resolution patch model of the island with realistic population densities and also mobility models for humans (based on real-motion data) and mosquitoes. In this metapopulation network, two models are coupled: one for the dynamics of the mosquito population and one for the transmission of the disease. A high-resolution numerical model is created from real geographical, demographical and mobility data. The Island is modeled with an 18,000-nodes metapopulation network. Numerical results show the impact of the geographical environment and populations’ mobility on the spread of the disease. The model is finally validated against real epidemic data from the Réunion event.",
    "URL": "http://www.sciencedirect.com/science/article/pii/S0022519312005838",
    "DOI": "10.1016/j.jtbi.2012.11.008",
    "ISSN": "0022-5193",
    "journalAbbreviation": "Journal of Theoretical Biology",
    "author": [
      {
        "family": "Moulay",
        "given": "Djamila"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      }
    ],
    "issued": {
      "date-parts": [["2013", 2, 7]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/UA6F8PGZ",
    "type": "book",
    "title": "Evolutionary Algorithms for Mobile Ad Hoc Networks: Bouvry/Evolutionary Algorithms for Mobile Ad Hoc Networks",
    "publisher": "John Wiley & Sons, Inc.",
    "publisher-place": "Hoboken, NJ",
    "source": "CrossRef",
    "event-place": "Hoboken, NJ",
    "URL": "http://doi.wiley.com/10.1002/9781118833209",
    "ISBN": "978-1-118-83320-9",
    "note": "DOI: 10.1002/9781118833209",
    "shortTitle": "Evolutionary Algorithms for Mobile Ad Hoc Networks",
    "language": "en",
    "author": [
      {
        "family": "Dorronsoro",
        "given": "Bernabé"
      },
      {
        "family": "Ruiz",
        "given": "Patricia"
      },
      {
        "family": "Danoy",
        "given": "Grégoire"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      },
      {
        "family": "Bouvry",
        "given": "Pascal"
      }
    ],
    "issued": {
      "date-parts": [["2014", 4, 30]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/TDFG7DDG",
    "type": "chapter",
    "title": "Time considerations for the study of complex maritime networks",
    "container-title": "Maritime Networks Spatial structures and time dynamics",
    "collection-title": "Routledge Studies in Transport Analysis",
    "publisher": "Routledge",
    "page": "163--189",
    "edition": "César Ducruet",
    "abstract": "This work proposes two new methodological approaches for the analysis of global shipping networks stemmed from containerships movements reported in Lloyds’ List Periodicals.  After a complex network analysis, the first approach proposes the analysis of sets of networks, called TG-Graphs, built from events occurring in constant-size sliding time windows. Time series represent the evolution of network measures, and the simultaneous analysis of these series for several measures highlights some phenomenons arising in the shipping network. In the second model, networks are modeled with temporal networks where each event is associated with a timestamp. In this model, distance-related measures take a new meaning since paths must obey time constraints. This approach reveals that although the global port network is highly connected, ports who are not directly connected to the main hubs are actually isolated from the rest of the network.",
    "URL": "https://www.routledge.com/products/9781138911253",
    "ISBN": "1-138-91125-9",
    "language": "English",
    "author": [
      {
        "family": "Guinand",
        "given": "Frédéric"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      }
    ],
    "issued": {
      "date-parts": [["2015"]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/XCXIJGS8",
    "type": "paper-conference",
    "title": "Impact of square environment on the connectivity in finite ad hoc networks",
    "container-title": "2011 14th International Symposium on Wireless Personal Multimedia Communications (WPMC)",
    "publisher-place": "Brest, France",
    "page": "1-5",
    "source": "IEEE Xplore",
    "event": "2011 14th International Symposium on Wireless Personal Multimedia Communications (WPMC)",
    "event-place": "Brest, France",
    "abstract": "This paper aims at studying some connectivity properties for random geometric graphs when they are constrained by the topological space in which they are embedded. More precisely, we focus our attention on limited square and rectangular environments. In order to analyse the impact of such environments on related graphs, we observe the evolution of mean degree. We propose an approach aiming at estimating the impact of the environment borders on the connectivity and we provide an analytical formula for computing the mean degree value depending on borders effects.",
    "author": [
      {
        "family": "Aboue Nze",
        "given": "G.-C."
      },
      {
        "family": "Guinand",
        "given": "F."
      },
      {
        "family": "Pigné",
        "given": "Y."
      }
    ],
    "issued": {
      "date-parts": [["2011", 10]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/TXWE973H",
    "type": "paper-conference",
    "title": "A Vehicular Mobility Model Based on Real Traffic Counting Data",
    "container-title": "Proceedings of the Third International Conference on Communication Technologies for Vehicles",
    "collection-title": "Nets4Cars/Nets4Trains'11",
    "publisher": "Springer-Verlag",
    "publisher-place": "Berlin, Heidelberg",
    "page": "131–142",
    "source": "ACM Digital Library",
    "event-place": "Berlin, Heidelberg",
    "abstract": "This paper proposes VehILux, a new vehicular mobility model based on real traffic counting data. It relies on two freely available sources of real information for the country of Luxembourg. The first source is traffic data collected by counting devices located on the Luxembourgian road network, while the second is geographical information about different types of areas: residential, industrial, commercial and other services. VehILux models vehicles commuting around the city of Luxembourg by considering two types of traffic, outer traffic with vehicles entering in the defined geographical area and inner traffic starting from residential zones located inside the geographical area. One part of the collected traffic data is used as input traffic, while another part is used to control the produced traffic and to fine-tune the model. VehILux is coupled with the microscopic road traffic simulator SUMO to produce realistic vehicular traces.",
    "URL": "http://dl.acm.org/citation.cfm?id=1987310.1987325",
    "ISBN": "978-3-642-19785-7",
    "author": [
      {
        "family": "Pigné",
        "given": "Yoann"
      },
      {
        "family": "Danoy",
        "given": "Grégoire"
      },
      {
        "family": "Bouvry",
        "given": "Pascal"
      }
    ],
    "issued": {
      "date-parts": [["2011"]]
    },
    "accessed": {
      "date-parts": [["2015", 3, 2]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/B2A24FH3",
    "type": "paper-conference",
    "title": "GraphStream: A Tool for bridging the gap between Complex Systems and Dynamic Graphs",
    "container-title": "Emergent Properties in Natural and Artificial Complex Systems. Satellite Conference within the 4th European Conference on Complex Systems (ECCS'2007)",
    "publisher-place": "Dresden, Germany",
    "event": "European Conference on Complex Systems",
    "event-place": "Dresden, Germany",
    "author": [
      {
        "family": "Dutot",
        "given": "Antoine"
      },
      {
        "family": "Guinand",
        "given": "Frédéric"
      },
      {
        "family": "Olivier",
        "given": "Damien"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      }
    ],
    "issued": {
      "date-parts": [["2007", 10]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/8XJ3NBQ2",
    "type": "article-journal",
    "title": "Using graph search algorithms for a rigorous application of emergy algebra rules",
    "container-title": "Metallurgical Research & Technology",
    "page": "8",
    "volume": "110",
    "issue": "1",
    "DOI": "10.1051/metal/2013050",
    "author": [
      {
        "family": "Marvuglia",
        "given": "A."
      },
      {
        "family": "Rugani",
        "given": "B."
      },
      {
        "family": "Rios",
        "given": "G."
      },
      {
        "family": "Pigné",
        "given": "Y."
      },
      {
        "family": "Benetto",
        "given": "E."
      },
      {
        "family": "Tiruta-Barna",
        "given": "L."
      }
    ],
    "issued": {
      "date-parts": [["2013"]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/R7Z4JNJG",
    "type": "chapter",
    "title": "Principes généraux de résolution de problèmes combinatoires",
    "container-title": "Fourmis artificielles 1, Des bases de l'optimisation aux applications industrielles",
    "page": "41-70",
    "source": "hal.inria.fr",
    "URL": "http://hal.archives-ouvertes.fr/hal-00457722",
    "author": [
      {
        "family": "Dutot",
        "given": "Antoine"
      },
      {
        "family": "Guinand",
        "given": "Frédéric"
      },
      {
        "family": "Olivier",
        "given": "Damien"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      }
    ],
    "issued": {
      "date-parts": [["2009"]]
    },
    "accessed": {
      "date-parts": [["2012", 12, 12]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/T4XCSS7V",
    "type": "chapter",
    "title": "Tour d'horizon des problèmes combinatoires traités par les fourmis artificielles",
    "container-title": "Fourmis artificielles 1, Des bases de l'optimisation aux applications industrielles",
    "page": "71-100",
    "source": "hal.inria.fr",
    "URL": "http://hal.archives-ouvertes.fr/hal-00457742",
    "author": [
      {
        "family": "Dutot",
        "given": "Antoine"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      }
    ],
    "issued": {
      "date-parts": [["2009"]]
    },
    "accessed": {
      "date-parts": [["2012", 12, 12]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/X4HISZW4",
    "type": "paper-conference",
    "title": "A Platform for Realistic Online Vehicular Network Management",
    "container-title": "IEEE International Workshop on Management of Emerging Networks and Services",
    "publisher": "IEEE Computer Society",
    "page": "615–619",
    "abstract": "This paper introduces a platform for realistic and computationally efficient online vehicular networks simulation. It permits decentralized traffic management applications simulation as nodes mobility is modifiable at runtime thanks to the integration of two state-of-the-art network and traffic simulators. The platform embeds a tool that generates vehicular traces based on traffic counting data and ensures performance through a geographical decomposition of the network. Evidence of its performance is given on a Luxembougian traffic management scenario, using real road network and traffic data.",
    "DOI": "10.1109/GLOCOMW.2010.5700389",
    "ISBN": "978-1-4244-8863-6",
    "author": [
      {
        "family": "Pigné",
        "given": "Yoann"
      },
      {
        "family": "Danoy",
        "given": "Grégoire"
      },
      {
        "family": "Bouvry",
        "given": "Pascal"
      }
    ],
    "issued": {
      "date-parts": [["2010"]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/82W9V7GS",
    "type": "chapter",
    "title": "An Ant-Based Model for Multiple Sequence Alignment",
    "container-title": "Large-Scale Scientific Computing",
    "collection-title": "Lecture Notes in Computer Science",
    "collection-number": "4818",
    "publisher": "Springer Berlin Heidelberg",
    "page": "553-560",
    "source": "link.springer.com",
    "abstract": "Multiple sequence alignment is a key process in today’s biology, and finding a relevant alignment of several sequences is much more challenging than just optimizing some improbable evaluation functions. Our approach for addressing multiple sequence alignment focuses on the building of structures in a new graph model: the factor graph model. This model relies on block-based formulation of the original problem, formulation that seems to be one of the most suitable ways for capturing evolutionary aspects of alignment. The structures are implicitly built by a colony of ants laying down pheromones in the factor graphs, according to relations between blocks belonging to the different sequences.",
    "URL": "http://link.springer.com/chapter/10.1007/978-3-540-78827-0_63",
    "ISBN": "978-3-540-78825-6",
    "author": [
      {
        "family": "Guinand",
        "given": "Frédéric"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      }
    ],
    "editor": [
      {
        "family": "Lirkov",
        "given": "Ivan"
      },
      {
        "family": "Margenov",
        "given": "Svetozar"
      },
      {
        "family": "Waśniewski",
        "given": "Jerzy"
      }
    ],
    "issued": {
      "date-parts": [["2008", 1, 1]]
    },
    "accessed": {
      "date-parts": [["2013", 11, 27]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/CB7IK787",
    "type": "chapter",
    "title": "Short and Robust Communication Paths in Dynamic Wireless Networks",
    "container-title": "Swarm Intelligence",
    "collection-title": "Lecture Notes in Computer Science",
    "collection-number": "6234",
    "publisher": "Springer Berlin Heidelberg",
    "page": "520-527",
    "source": "link.springer.com",
    "abstract": "We consider the problem of finding and maintaining communication paths in wireless mobile ad hoc networks (MANET). We consider this problem as a bi-objective problem when trying to minimize both the length of the constructed paths and the number link reconnections. We propose two centralized algorithms that help analyse the problem from a dynamic graph point of view. These algorithms give lower bounds for our proposed decentralized ant-based algorithm that constructs and maintains such paths in a MANET.",
    "URL": "http://link.springer.com/chapter/10.1007/978-3-642-15461-4_52",
    "ISBN": "978-3-642-15460-7",
    "author": [
      {
        "family": "Pigné",
        "given": "Yoann"
      },
      {
        "family": "Guinand",
        "given": "Frédéric"
      }
    ],
    "editor": [
      {
        "family": "Dorigo",
        "given": "Marco"
      },
      {
        "family": "Birattari",
        "given": "Mauro"
      },
      {
        "family": "Caro",
        "given": "Gianni A. Di"
      },
      {
        "family": "Doursat",
        "given": "René"
      },
      {
        "family": "Engelbrecht",
        "given": "Andries P."
      },
      {
        "family": "Floreano",
        "given": "Dario"
      },
      {
        "family": "Gambardella",
        "given": "Luca Maria"
      },
      {
        "family": "Groß",
        "given": "Roderich"
      },
      {
        "family": "Şahin",
        "given": "Erol"
      },
      {
        "family": "Sayama",
        "given": "Hiroki"
      },
      {
        "family": "Stützle",
        "given": "Thomas"
      }
    ],
    "issued": {
      "date-parts": [["2010", 1, 1]]
    },
    "accessed": {
      "date-parts": [["2013", 11, 27]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/H4SQS5UX",
    "type": "chapter",
    "title": "Distributed Maintenance of Anytime Available Spanning Trees in Dynamic Networks",
    "container-title": "Ad-hoc, Mobile, and Wireless Network",
    "collection-title": "Lecture Notes in Computer Science",
    "publisher": "Springer Berlin Heidelberg",
    "page": "99-110",
    "volume": "7960",
    "URL": "http://dx.doi.org/10.1007/978-3-642-39247-4_9",
    "ISBN": "978-3-642-39246-7",
    "editor": [
      {
        "family": "Cichoń",
        "given": "Jacek"
      },
      {
        "family": "Gȩbala",
        "given": "Maciej"
      },
      {
        "family": "Klonowski",
        "given": "Marek"
      }
    ],
    "author": [
      {
        "family": "Casteigts",
        "given": "Arnaud"
      },
      {
        "family": "Chaumette",
        "given": "Serge"
      },
      {
        "family": "Guinand",
        "given": "Frédéric"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      }
    ],
    "issued": {
      "date-parts": [["2013"]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/TTFMS973",
    "type": "paper-conference",
    "title": "Impact of Obstacles on the Degree of Mobile Ad Hoc Connection Graphs",
    "container-title": "Proceedings of the 2009 Fifth International Conference on Networking and Services",
    "collection-title": "ICNS '09",
    "publisher": "IEEE Computer Society",
    "publisher-place": "Washington, DC, USA",
    "page": "332–337",
    "source": "ACM Digital Library",
    "event-place": "Washington, DC, USA",
    "abstract": "What is the impact of obstacles on the graphs of connections between stations in Mobile Ad hoc Networks? In order to answer, at least partially, this question, the first step is to define both an environment with obstacles and a mobility model for the stations in such an environment. The present paper focuses on a new way of considering the mobility within environments with obstacles, while keeping the core ideas of the well-known Random WayPoint mobility model (a.k.a RWP). Based on a mesh-partitioning of the space, we propose a new model called RSP-O-G for which we compute the spatial distribution of stations and analyse how the presence of obstacles impacts this distribution compared to the distribution when no obstacles are present. Coupled with a simple model of radio propagation, and according to the density of stations in the environment, we study the mean degree of the connection graphs corresponding to such mobile ad hoc networks.",
    "URL": "http://dx.doi.org/10.1109/ICNS.2009.36",
    "DOI": "10.1109/ICNS.2009.36",
    "ISBN": "978-0-7695-3586-9",
    "author": [
      {
        "family": "Aboue-Nze",
        "given": "Cédric Gaël"
      },
      {
        "family": "Guinand",
        "given": "Frédéric"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      }
    ],
    "issued": {
      "date-parts": [["2009"]]
    },
    "accessed": {
      "date-parts": [["2012", 12, 12]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/2DFXPZVW",
    "type": "paper-conference",
    "title": "Construction et maintien d'une forêt couvrante dans un réseau dynamique",
    "container-title": ".",
    "source": "hal.inria.fr",
    "event": "12èmes Rencontres Francophones sur les Aspects Algorithmiques de Télécommunications (AlgoTel)",
    "abstract": "In this work we introduce the principles of an algorithm that constructs and maintains a spanning forest in a mobile telecommunication network—a MANET. The algorithm is based on the random walk of a token and is entirely decentralized. A probability analysis is performed when the network is static. Then we show that performances can be slightly enhanced when adding a memory process in the walk on the token.",
    "URL": "http://hal.inria.fr/inria-00477755",
    "author": [
      {
        "family": "Pigné",
        "given": "Yoann"
      },
      {
        "family": "Casteigts",
        "given": "Arnaud"
      },
      {
        "family": "Guinand",
        "given": "Frédéric"
      },
      {
        "family": "Chaumette",
        "given": "Serge"
      }
    ],
    "issued": {
      "date-parts": [["2010"]]
    },
    "accessed": {
      "date-parts": [["2012", 12, 12]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/GBMWDS8M",
    "type": "paper-conference",
    "title": "Sensitivity analysis for a realistic vehicular mobility model",
    "container-title": "Proceedings of the first ACM international symposium on Design and analysis of intelligent vehicular networks and applications",
    "collection-title": "DIVANet '11",
    "publisher": "ACM",
    "publisher-place": "New York, NY, USA",
    "page": "31–38",
    "source": "ACM Digital Library",
    "event-place": "New York, NY, USA",
    "abstract": "In this article, we consider a realistic vehicular mobility model, VehILux, and use a sensitivity analysis method to quantitatively study the influence and interdependencies of its parameters. The analysis reveals several properties in the set of parameters. Some are identified as irrelevant to the output while some have stronger impact than expected. This analysis is proposed as a preliminary step to the mobility model optimization, as it permits to significantly reduce the parameters search space.",
    "URL": "http://doi.acm.org/10.1145/2069000.2069007",
    "DOI": "10.1145/2069000.2069007",
    "ISBN": "978-1-4503-0904-2",
    "author": [
      {
        "family": "Pigné",
        "given": "Yoann"
      },
      {
        "family": "Danoy",
        "given": "Grégoire"
      },
      {
        "family": "Bouvry",
        "given": "Pascal"
      }
    ],
    "issued": {
      "date-parts": [["2011"]]
    },
    "accessed": {
      "date-parts": [["2012", 12, 12]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/83T7NC82",
    "type": "article-journal",
    "title": "Problem Solving and Complex Systems",
    "container-title": "arXiv:0803.2314",
    "source": "arXiv.org",
    "abstract": "The observation and modeling of natural Complex Systems (CSs) like the human nervous system, the evolution or the weather, allows the definition of special abilities and models reusable to solve other problems. For instance, Genetic Algorithms or Ant Colony Optimizations are inspired from natural CSs to solve optimization problems. This paper proposes the use of ant-based systems to solve various problems with a non assessing approach. This means that solutions to some problem are not evaluated. They appear as resultant structures from the activity of the system. Problems are modeled with graphs and such structures are observed directly on these graphs. Problems of Multiple Sequences Alignment and Natural Language Processing are addressed with this approach.",
    "URL": "http://arxiv.org/abs/0803.2314",
    "note": "Emergent Properties in Natural and Artificial Dynamical Systems, Springer Verlag (Ed.) (2006) 53-86",
    "author": [
      {
        "family": "Guinand",
        "given": "Frédéric"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      }
    ],
    "issued": {
      "date-parts": [["2008", 3, 15]]
    },
    "accessed": {
      "date-parts": [["2012", 12, 12]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/WPU6RT9Q",
    "type": "thesis",
    "title": "Modélisation et traitement décentralisé des graphes dynamiques Application aux réseaux mobiles ad hoc",
    "publisher": "Université du Havre",
    "source": "tel.archives-ouvertes.fr",
    "abstract": "Les graphes dynamiques sont un outil de plus en plus utilisé dans des contextes variés où il s'avère nécessaire de modéliser des environnements changeants ou incertains. Les modèles aujourd'hui proposés sont dédiés à ces applications précises. Il n'existe pas de modèle général reprenant, hors de tout contexte applicatif, ces caractéristiques. D'autre part la résolution de problèmes liés à ces environnements dynamiques et incertains est problématique. Nous proposons, ici, la formalisation d'un modèle général de graphe dynamique.   Nous étudions la résolution de problèmes dans ces graphes à l'aide de méthodes inspirées de mécanismes d'intelligence collective.   Les modèles proposés sont validés dans le contexte applicatif des réseaux mobiles ad hoc. Une approche originale de construction et de maintien de chemins de communication sous plusieurs contraintes est proposée. Le problème de la construction et du maintien d'une forêt couvrante dans un réseau mobile ad hoc est également étudié.",
    "URL": "http://tel.archives-ouvertes.fr/tel-00371962",
    "author": [
      {
        "family": "Pigné",
        "given": "Yoann"
      }
    ],
    "issued": {
      "date-parts": [["2008", 12, 4]]
    },
    "accessed": {
      "date-parts": [["2013", 1, 10]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/2VS8AMEY",
    "type": "paper-conference",
    "title": "Moving Average control chart for the detection and isolation of temporal faults in stochastic Petri nets",
    "container-title": "23rd IEEE International Conference on Emerging Technologies and Factory Automation, ETFA 2018, Torino, Italy, September 4-7, 2018",
    "publisher": "IEEE",
    "page": "493–498",
    "source": "DBLP Computer Science Bibliography",
    "DOI": "10.1109/ETFA.2018.8502633",
    "author": [
      {
        "family": "Rachidi",
        "given": "Sara"
      },
      {
        "family": "Leclercq",
        "given": "Edouard"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      },
      {
        "family": "Lefebvre",
        "given": "Dimitri"
      }
    ],
    "issued": {
      "date-parts": [["2018"]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/7M9TMWRS",
    "type": "paper-conference",
    "title": "Temporal fault diagnosis for k-bounded non-Markovian SPN",
    "container-title": "5th International Conference on Control, Decision and Information Technologies, CoDIT 2018, Thessaloniki, Greece, April 10-13, 2018",
    "publisher": "IEEE",
    "page": "271–276",
    "source": "DBLP Computer Science Bibliography",
    "DOI": "10.1109/CoDIT.2018.8394843",
    "ISBN": "978-1-5386-5065-3",
    "author": [
      {
        "family": "Lefebvre",
        "given": "Dimitri"
      },
      {
        "family": "Rachidi",
        "given": "Sara"
      },
      {
        "family": "Leclercq",
        "given": "Edouard"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      }
    ],
    "issued": {
      "date-parts": [["2018"]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/BJMCV8P2",
    "type": "article-journal",
    "title": "Diagnosis of Structural and Temporal Faults for k-Bounded Non-Markovian Stochastic Petri Nets",
    "container-title": "IEEE Transactions on Systems, Man, and Cybernetics: Systems",
    "page": "1-13",
    "volume": "PP",
    "source": "ResearchGate",
    "abstract": "This paper concerns the diagnosis of faults for stochastic discrete event systems that behave according to non-Markovian dynamics. k-bounded partially observed Petri nets are used to model the system structure and the sensors. Stochastic processes with probability density functions (pdf) of finite support define the dynamics. Structural and temporal faults are considered. Structural faults correspond to specific sequences of events that should satisfy precedence conditions defined with patterns. Temporal faults are defined with time constraints that must be fulfilled by the firing durations. The probabilities of consistent trajectories are computed with a numerical scheme from the collected timed measurements. The advantage of the proposed scheme is that it can be used for a large variety of pdf that may be defined either with an analytical or a numerical description. It works also for various time semantics. Diagnosis in terms of probability for faulty patterns and temporal constraints is established as a consequence.",
    "DOI": "10.1109/TSMC.2018.2875726",
    "journalAbbreviation": "IEEE Transactions on Systems, Man, and Cybernetics: Systems",
    "author": [
      {
        "family": "Lefebvre",
        "given": "Dimitri"
      },
      {
        "family": "Rachidi",
        "given": "Sara"
      },
      {
        "family": "Leclercq",
        "given": "E"
      },
      {
        "family": "Pigne",
        "given": "Yoann"
      }
    ],
    "issued": {
      "date-parts": [["2018", 11, 9]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/D76RJQTI",
    "type": "paper-conference",
    "title": "New Selection Strategies of Actor’s Substitute in DARA for Connectivity Restoration in WSANs",
    "container-title": "Ad Hoc Networks",
    "collection-title": "Lecture Notes of the Institute for Computer Sciences, Social Informatics and Telecommunications Engineering",
    "publisher": "Springer International Publishing",
    "page": "38-49",
    "source": "Springer Link",
    "abstract": "Wireless Sensor and Actor Networks are used in many dangerous applications. When performing their tasks, actors may fail due to harsh environments in which they are deployed. Some actors are cut-vertices within network. Their loss breaks its connectivity and disrupts its operation accordingly. Therefore, restoring network connectivity is crucial. DARA is among the most popular connectivity restoration schemes. It performs multi-actor relocations in order to replace a failed cut-vertex by one of its neighbors, based on the lowest degree. In this paper, we propose new selection strategies of actor’s substitute in DARA, in which the substitute selection is based on the nature of the links with neighbors rather than on the degree. Our approaches improve the performance of DARA by reducing the number of relocated actors in the recovery process by 24% on average compared to its original selection strategy. The proposed strategies are validated through simulation experiments.",
    "DOI": "10.1007/978-3-319-51204-4_4",
    "ISBN": "978-3-319-51204-4",
    "language": "en",
    "author": [
      {
        "family": "Saada",
        "given": "Riadh"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      },
      {
        "family": "Olivier",
        "given": "Damien"
      }
    ],
    "editor": [
      {
        "family": "Zhou",
        "given": "Yifeng"
      },
      {
        "family": "Kunz",
        "given": "Thomas"
      }
    ],
    "issued": {
      "date-parts": [["2017"]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/8736L66T",
    "type": "article-journal",
    "title": "Bayesian Dynamic Linear Model with Adaptive Parameter Estimation for Short-Term Travel Speed Prediction",
    "container-title": "Journal of Advanced Transportation",
    "page": "10",
    "volume": "2019",
    "abstract": "Bayesian dynamic linear model is a promising method for time series data analysis and short-term forecasting. One research issue concerns how the predictive model adapts to changes in the system, especially when shocks impact system behavior. In this study, we propose an adaptive dynamic linear model to adaptively update model parameters for online system state prediction. The proposed method is an automatic approach based on the feedback of prediction errors at each time slot without the needs of external intervention. The experimental study on short-term travel speed prediction shows that the proposed method can significantly reduce the prediction errors of the traditional dynamic linear model and outperform two state-of-the-art methods in the case of major system behavior changes.",
    "URL": "https://www.hindawi.com/journals/jat/2019/5314520/",
    "DOI": "10.1155/2019/5314520",
    "note": "DOI: 10.1155/2019/5314520",
    "journalAbbreviation": "JAT",
    "language": "en",
    "author": [
      {
        "family": "Ma",
        "given": "Tai-Yu"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      }
    ],
    "issued": {
      "date-parts": [["2019"]]
    },
    "accessed": {
      "date-parts": [["2019", 6, 24]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/2XLSNXI7",
    "type": "article-journal",
    "abstract": "This work focuses on the minimum cost flow problem in dynamic graphs. The model here proposed does not have travel time nor storage but all other parameters are time-dependent. The most popular method to solve this kind of problem uses the time-expanded graph but due to the large size of this graph, this solution technique is not manageable on a long time horizon. We propose a new approach that does not use the time-expanded graph. Our algorithm is based on the computation of successive shortest paths on static graphs, which are much smaller compared to the time-expanded graph. It has a significantly better computational complexity. Our method was implemented using the GraphStream library and experiments showed that it is also much faster than the classical method in practice.",
    "container-title": "Discrete Applied Mathematics",
    "DOI": "10.1016/j.dam.2019.12.012",
    "ISSN": "0166-218X",
    "journalAbbreviation": "Discrete Applied Mathematics",
    "language": "en",
    "source": "ScienceDirect",
    "title": "A theoretical and experimental study of a new algorithm for minimum cost flow in dynamic graphs",
    "URL": "http://www.sciencedirect.com/science/article/pii/S0166218X19305554",
    "author": [
      {
        "family": "Vernet",
        "given": "Mathilde"
      },
      {
        "family": "Drozdowski",
        "given": "Maciej"
      },
      {
        "family": "Pigné",
        "given": "Yoann"
      },
      {
        "family": "Sanlaville",
        "given": "Eric"
      }
    ],
    "accessed": {
      "date-parts": [["2020", 9, 25]]
    },
    "issued": {
      "date-parts": [["2020", 1, 7]]
    }
  },
  {
    "id": "http://zotero.org/users/809971/items/ZBJI88NN",
    "type": "article-journal",
    "abstract": "The objective is to demonstrate an operational tool for dynamic LCA, based on the model by Tiruta-Barna et al. (J Clean Prod 116:198-206, Tiruta-Barna et al. 2016). The main innovation lies in the combination of full temporalization of the background inventory and a graph search algorithm leading to full dynamic LCI, further coupled to dynamic LCIA. The following objectives were addressed: (1) development of a database with temporal parameters for all processes of ecoinvent 3.2, (2) implementation of the model and the database in integrated software, and (3) demonstration on a case study comparing a conventional internal combustion engine car to an electric one.",
    "container-title": "The International Journal of Life Cycle Assessment",
    "DOI": "10.1007/s11367-019-01696-6",
    "ISSN": "1614-7502",
    "issue": "2",
    "journalAbbreviation": "Int J Life Cycle Assess",
    "language": "en",
    "page": "267-279",
    "source": "Springer Link",
    "title": "A tool to operationalize dynamic LCA, including time differentiation on the complete background database",
    "URL": "https://doi.org/10.1007/s11367-019-01696-6",
    "volume": "25",
    "author": [
      {
        "family": "Pigné",
        "given": "Yoann"
      },
      {
        "family": "Gutiérrez",
        "given": "Tomás Navarrete"
      },
      {
        "family": "Gibon",
        "given": "Thomas"
      },
      {
        "family": "Schaubroeck",
        "given": "Thomas"
      },
      {
        "family": "Popovici",
        "given": "Emil"
      },
      {
        "family": "Shimako",
        "given": "Allan Hayato"
      },
      {
        "family": "Benetto",
        "given": "Enrico"
      },
      {
        "family": "Tiruta-Barna",
        "given": "Ligia"
      }
    ],
    "accessed": {
      "date-parts": [["2020", 9, 25]]
    },
    "issued": {
      "date-parts": [["2020", 2, 1]]
    }
  }
]
